#+title: Lesson 00 — The Bloch Equations
#+subtitle: What a Spinning Atom Does in a Magnetic Field
#+author: MāyāPramāṇa
#+date: February 2026
#+LOOM: lesson
#+DEFINES: BlochState BlochParams bloch_derivative rk4_step simulate rb87Params
#+DEPENDS: (none)
#+EXPORTS: chalkboard_setup.png chalkboard_precession_cone.png chalkboard_relaxation.png chalkboard_bloch_terms.png chalkboard_magnetometer.png bloch_precession.png
#+CADENZAS: spin-in-a-field why-it-precesses bloch-sphere-geometry relaxation-physics numerical-ode-methods atomic-magnetometry
#+property: header-args :mkdirp yes :eval never-export
#+property: header-args:python :session bloch :results output :eval no-export
#+property: header-args:haskell :tangle ../../haskell/src/Physics/Bloch.hs
#+property: header-args:cpp :tangle ../../cpp/src/core/bloch.hpp

#+begin_comment
Activate the project virtual environment and set PYTHONPATH so that
both :session and :session none blocks find the mayapramana package.
Run this block first (C-c C-c) when opening the notebook.
#+end_comment
#+begin_src elisp :results silent :eval no-export
(let* ((lesson-dir (file-name-directory (buffer-file-name)))
       (project-root (expand-file-name "../.." lesson-dir))
       (venv-dir (expand-file-name ".venv" project-root))
       (python-dir (expand-file-name "python" project-root)))
  ;; Activate venv — sets python-shell-interpreter for ob-python
  (pyvenv-activate venv-dir)
  ;; Add the python/ tree to PYTHONPATH so all blocks can import mayapramana
  (setenv "PYTHONPATH"
          (let ((existing (getenv "PYTHONPATH")))
            (if (and existing (string-match-p (regexp-quote python-dir) existing))
                existing
              (if existing
                  (concat python-dir ":" existing)
                python-dir))))
  (message "MāyaPramāṇa: venv %s, PYTHONPATH includes %s" venv-dir python-dir))
#+end_src

#+begin_comment
Smoke-test: verify the Python session can import everything.
#+end_comment
*** Constants and Types

#+begin_src python
import numpy as np
from dataclasses import dataclass


@dataclass
class BlochState:
    """The Bloch vector M = (Mx, My, Mz)."""
    mx: float
    my: float
    mz: float

    def as_array(self) -> np.ndarray:
        return np.array([self.mx, self.my, self.mz])

    @staticmethod
    def from_array(a: np.ndarray) -> 'BlochState':
        return BlochState(mx=a[0], my=a[1], mz=a[2])

    @property
    def norm(self) -> float:
        return np.sqrt(self.mx**2 + self.my**2 + self.mz**2)


@dataclass
class BlochParams:
    """Physical parameters for the Bloch equations."""
    gamma: float    # gyromagnetic ratio [rad/s/T]
    t1: float       # longitudinal relaxation time [s]
    t2: float       # transverse relaxation time [s]
    m0: float       # equilibrium magnetisation (dimensionless)


# Rb-87 ground state F=2
RB87_PARAMS = BlochParams(
    gamma=2 * np.pi * 7e9 * 0.5,  # g_F * mu_B / hbar
    t1=0.1,                        # 100 ms (typical vapour cell)
    t2=0.01,                        # 10 ms
    m0=0.0                          # no pumping yet
)

print(f"Rb-87 Larmor frequency at 50 μT: "
      f"{RB87_PARAMS.gamma * 50e-6 / (2*np.pi):.0f} Hz")
#+end_src

#+RESULTS:
: Rb-87 Larmor frequency at 50 μT: 175000 Hz

175 kHz. Our precessing atom.

